Just to complete the circle I decided to test the old image on the Centos 8 VM I created and it did NOT exhibit the problem you reported:

```
[user01@centos8 terraform-esxi]$ docker rmi tribrhy/iactools:1.0
Untagged: tribrhy/iactools:1.0
Untagged: tribrhy/iactools@sha256:10b18a43646188116d71193ba0da328cc374c726e77ba515cd99f1092d830175
Deleted: sha256:899e15de3ed0f240a3b91c0cde4ccf86608d174579553b96d1d185411b26a671
Deleted: sha256:d0b3cae4bfbc04262a0ac5977be746e6f34931647299bdf55b96ae78f7485b18
Deleted: sha256:739eb2a2bdad970cfdec95817673b1a1c0bf9f09cc5840f23c78c97287c8303f
Deleted: sha256:a7ad4e1672bd7ff726e7d6db7983eb6050543f774bbe5a7d7906d06f9662e3b8
Deleted: sha256:7515ee845913c8df9826c988341a09e0240e291c66bdc436a067e070d7910a1f
Deleted: sha256:50ebe6a0675f1ed7ca499a2ec7d8cc993d495dd66ca1035c218ec5efcb6fbb8c
Deleted: sha256:2515e0ecfb82d58c004c4b53fcf9230d9eca8d0f5f823c20172be01eec587ccb
Deleted: sha256:ce30112909569cead47eac188789d0cf95924b166405aa4b71fb500d6e4ae08d
```

Here I updated `test.sh` and `main.tf` to use iactools:1.0


```
[user01@centos8 terraform-esxi]$ ./test.sh                                      
Trying to remove the image to ensure we are testing the latest
Error: No such image: tribrhy/iactools:latest
Enter password for your ESXi server: Unable to find image 'tribrhy/iactools:1.0' locally
1.0: Pulling from tribrhy/iactools
3ff22d22a855: Pull complete
e7cb79d19722: Pull complete
323d0d660b6a: Pull complete
b7f616834fd0: Pull complete
f93e8522a3f0: Pull complete
8dde8677bc3f: Pull complete
1ff58ee2cb78: Pull complete
Digest: sha256:10b18a43646188116d71193ba0da328cc374c726e77ba515cd99f1092d830175
Status: Downloaded newer image for tribrhy/iactools:1.0

Initializing the backend...

Initializing provider plugins...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # esxi_guest.myvirtualmachine will be created
  + resource "esxi_guest" "myvirtualmachine" {
      + boot_disk_size         = "200"
      + boot_disk_type         = "thin"
      + disk_store             = "alldisks"
      + guest_name             = "myvirtualmachine"
      + guest_shutdown_timeout = (known after apply)
      + guest_startup_timeout  = (known after apply)
      + guestos                = "centos-64"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + memsize                = "8192"
      + notes                  = (known after apply)
      + numvcpus               = "4"
      + ovf_properties_timer   = (known after apply)
      + power                  = "off"
      + resource_pool_name     = (known after apply)
      + virthwver              = "13"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

So, after seeing this, using the latest might not fix your issue.

Are you sure nobody switched your machine for a Mac?   ;)